УТ_для_edt/src/DataProcessors/CRM_МенеджерПочты/CRM_МенеджерПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_МенеджерПочты</name>
</mdclass:DataProcessor>

УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_МенеджерПочты/Forms/ФормаФильтра/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.СтруктураФильтра);
	
	УстановитьПараметрыВыбора();
	
	ОбновитьПредставлениеПериода();
	
	CRM_СоздатьКнопкиРежимФильтра();
	
	Если Параметры.СтруктураФильтра.Свойство("НастройкиКомпоновки") И Параметры.СтруктураФильтра.НастройкиКомпоновки <> Неопределено Тогда
		РежимФильтра = 1;
		ПокраситьКнопкиРежимФильтраНаСервере();
		Элементы.ГруппаПростыеНастройки.Видимость = Ложь;
		Элементы.ГруппаРасширенныеНастройки.Видимость = Истина;
		ИнициализацияКомпоновки();
		Компоновщик.ЗагрузитьНастройки(Параметры.СтруктураФильтра.НастройкиКомпоновки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РежимФильтра = 0 Тогда
		CRM_Простой(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Период

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент)

	Оповещение = Новый ОписаниеОповещения("ПредставлениеПериодаНажатиеЗавершение", ЭтотОбъект);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = Период;
	Диалог.Показать(Оповещение); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатиеЗавершение(НовыйПериод, ДополнительныеДанные) Экспорт
	
	Если НовыйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыйПериод)=Тип("СтандартныйПериод") Тогда
		Период = НовыйПериод;
	ИначеЕсли ТипЗнч(НовыйПериод)=Тип("Дата") Тогда
		Период.ДатаНачала = '0001-01-01';
		Период.ДатаОкончания = НовыйПериод;
		Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	КонецЕсли;
	
	ПериодПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииСервер()
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПредставлениеПериода()
	
	Если НЕ Элементы.ПредставлениеПериодаКнопка.Видимость Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) И НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ПредставлениеПериода = НСтр("ru='за все время';en='For All Time'");
	//ИначеЕсли Элементы.ПредставлениеПериода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет Тогда
	//	ПредставлениеПериода = НСтр("ru='за ';en='for '")+НРег(ПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Период.ДатаОкончания)));
	Иначе
		ПредставлениеПериода = НРег(ПредставлениеПериода(НачалоДня(Период.ДатаНачала), ?(ЗначениеЗаполнено(Период.ДатаОкончания), КонецДня(Период.ДатаОкончания), Период.ДатаОкончания)));
	КонецЕсли;
	
	Элементы.ПредставлениеПериодаКнопка.Заголовок = ПредставлениеПериода;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если Ответственный = Неопределено Тогда
		Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	ВыбранПользователь = (ТипЗнч(Ответственный) = Тип("СправочникСсылка.Пользователи"));
	
	
	Если ВыбранПользователь Тогда
		
		УстановитьПараметрыВыбора();
		
	Иначе
		
		Элементы.Ответственный.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Закрыть(ПолучитьСтруктуруФильтра());
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьНаСервере();
		
	Если Элементы.ГруппаРасширенныеНастройки.Видимость Тогда
		ИнициализацияКомпоновки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура CRM_Простой(Команда)
	
	РежимФильтра = 0;
	ПокраситьКнопкиРежимФильтраНаСервере();
	
	Элементы.ГруппаПростыеНастройки.Видимость = Истина;
	Элементы.ГруппаРасширенныеНастройки.Видимость = Ложь;
	ЗаполнитьПоляФильтраПоОтборуКомпоновщика();

КонецПроцедуры

&НаКлиенте
Процедура CRM_Расширенный(Команда)
	
	РежимФильтра = 1;
	ПокраситьКнопкиРежимФильтраНаСервере();
	
	Элементы.ГруппаПростыеНастройки.Видимость = Ложь;
	Элементы.ГруппаРасширенныеНастройки.Видимость = Истина;
	ЗаполнитьОтборКомпоновщика();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияКомпоновки()

	СхемаКомпоновкиДанных = Обработки.CRM_МенеджерПочты.ПолучитьМакет("МакетФильтра");

	ХранилищеСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
    Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ХранилищеСхемы));
    Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляФильтраПоОтборуКомпоновщика()
	
	Если Компоновщик.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьНаСервере();
	
	Для Каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если ЭлементОтбора.Использование Тогда
				ЭтотОбъект[ЭлементОтбора.Представление] = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			Для Каждого ЭлементОтбораГруппы Из ЭлементОтбора.Элементы Цикл
				Если ЭлементОтбораГруппы.Использование Тогда
					ЭтотОбъект[ЭлементОтбораГруппы.Представление] = ЭлементОтбораГруппы.ПравоеЗначение;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтборКомпоновщика()
	
	ИнициализацияКомпоновки();
	
	Для Каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если ЗначениеЗаполнено(ЭтотОбъект[ЭлементОтбора.Представление]) Тогда
				ЭлементОтбора.ПравоеЗначение = ЭтотОбъект[ЭлементОтбора.Представление];
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			Для Каждого ЭлементОтбораГруппы Из ЭлементОтбора.Элементы Цикл
				Если ЗначениеЗаполнено(ЭтотОбъект[ЭлементОтбораГруппы.Представление]) Тогда
					ЭлементОтбораГруппы.ПравоеЗначение = ЭтотОбъект[ЭлементОтбораГруппы.Представление];
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруФильтра()
	
	СтруктураФильтра = Новый Структура;
	
	СтруктураФильтра.Вставить("Период", Период);
	
	Если Элементы.ГруппаПростыеНастройки.Видимость Тогда
		СтруктураФильтра.Вставить("Отправитель", Отправитель);
		СтруктураФильтра.Вставить("Получатель", Получатель);
		СтруктураФильтра.Вставить("Тема", Тема);
		СтруктураФильтра.Вставить("ТекстПисьма", ТекстПисьма);	
		СтруктураФильтра.Вставить("Ответственный", Ответственный);
		СтруктураФильтра.Вставить("НастройкиКомпоновки", Неопределено);
	КонецЕсли;
	
	Если Элементы.ГруппаРасширенныеНастройки.Видимость Тогда
		
		Для Каждого ЭлементОтбора Из Компоновщик.Настройки.Отбор.Элементы Цикл
		
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				
				Если ЭлементОтбора.Использование Тогда
					СтруктураФильтра.Вставить(ЭлементОтбора.Представление, ЭлементОтбора.ПравоеЗначение);
				Иначе
					СтруктураФильтра.Вставить(ЭлементОтбора.Представление);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
				Для Каждого ЭлементОтбораГруппы Из ЭлементОтбора.Элементы Цикл
					Если ЭлементОтбораГруппы.Использование Тогда
						СтруктураФильтра.Вставить(ЭлементОтбораГруппы.Представление, ЭлементОтбораГруппы.ПравоеЗначение);
					Иначе
						СтруктураФильтра.Вставить(ЭлементОтбораГруппы.Представление);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураФильтра.Вставить("НастройкиКомпоновки", Компоновщик.Настройки);
		
	КонецЕсли;
	
	СтруктураФильтра.Вставить("ПоказатьТолькоНепрочитанные", ПоказатьТолькоНепрочитанные);
	
	Возврат СтруктураФильтра;
	
КонецФункции	

&НаСервере
Функция ОчиститьНаСервере()
	
	Период = Новый СтандартныйПериод;
	ОбновитьПредставлениеПериода();
	
	Отправитель = "";
	Получатель = "";
	Тема = "";
	ТекстПисьма = "";
	Ответственный = Справочники.Пользователи.ПустаяСсылка(); //Пользователи.ТекущийПользователь();
	ПоказатьТолькоНепрочитанные = Ложь;

КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбора()
	
	ПараметрыВыбораПользователь = Новый Массив;
	ПараметрыВыбораПользователь.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ПараметрыСеанса.CRM_ДоступныеПользователи));
	Элементы.Ответственный.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПользователь);
	
КонецПроцедуры

&НаСервере
Процедура CRM_СоздатьКнопкиРежимФильтра()
	
	СтруктураСоздания = Новый Структура;
	
	СтруктураКоманднаяПанель = Новый Структура;
	СтруктураКоманднаяПанель.Вставить("Имя", "CRM_РежимФильтра_Группа");
	СтруктураКоманднаяПанель.Вставить("Родитель", "CRM_РежимФильтра");
	
	СтруктураГруппаКнопок = Новый Структура;
	СтруктураГруппаКнопок.Вставить("Имя", "CRM_РежимФильтра_Элемент");
	
	СтруктураСоздания.Вставить("СтруктураКоманднаяПанель", СтруктураКоманднаяПанель);
	СтруктураСоздания.Вставить("СтруктураГруппаКнопок", СтруктураГруппаКнопок);
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Простой";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru = 'Простой'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	СтруктураКнопка.Вставить("Пометка", Истина);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Расширенный";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Заголовок", НСтр("ru = 'Расширенный'"));
	СтруктураКнопка.Вставить("ИмяКоманды", ИмяОписания);
	СтруктураКнопка.Вставить("Действие", ИмяОписания);
	СтруктураКнопка.Вставить("Отображение", ОтображениеКнопки.Текст);
	СтруктураКнопка.Вставить("ОтображениеФигуры", ОтображениеФигурыКнопки.Всегда);
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	
	СтруктураСоздания.Вставить("СтруктураВидимыеКнопки", СтруктураВидимыеКнопки);
	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().СформироватьКоманднуюПанельПоСтуктуре(ЭтотОбъект, СтруктураСоздания);
	
	//
	
	ГруппаКнопокТумблера = Элементы.Найти("CRM_РежимФильтра_Группа");
	Если ГруппаКнопокТумблера <> Неопределено Тогда
		//ГруппаКнопокТумблера.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ГруппаКнопокТумблера.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПокраситьКнопкиРежимФильтраНаСервере()
	
	НомерКнопки = 1;
	
	Если РежимФильтра = 0 Тогда
		НомерКнопки = 1;
	ИначеЕсли РежимФильтра = 1 Тогда
		НомерКнопки = 2;
	КонецЕсли;
	
	СтруктураВидимыеКнопки = Новый Структура;
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Простой";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 1, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);
	
	СтруктураКнопка = Новый Структура;
	ИмяОписания = "CRM_Расширенный";
	СтруктураКнопка.Вставить("ИмяКнопки", ИмяОписания);
	СтруктураКнопка.Вставить("Пометка", ?(НомерКнопки = 2, Истина, Ложь));
	
	СтруктураВидимыеКнопки.Вставить(ИмяОписания, СтруктураКнопка);


	CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ПокраситьКнопки(ЭтотОбъект, СтруктураВидимыеКнопки);
	
КонецПроцедуры

#КонецОбласти
